OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f615.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 1, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 1, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 1, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define VCFG                    ADCON0bits.VCFG                 // bit 6
#define ADFM                    ADCON0bits.ADFM                 // bit 7

#define AN0                     ANSELbits.AN0                   // bit 0
#define AN1                     ANSELbits.AN1                   // bit 1
#define AN2                     ANSELbits.AN2                   // bit 2
#define AN3                     ANSELbits.AN3                   // bit 3
#define ADCS0                   ANSELbits.ADCS0                 // bit 4
#define ADCS1                   ANSELbits.ADCS1                 // bit 5
#define ADCS2                   ANSELbits.ADCS2                 // bit 6

#define P1ASEL                  APFCONbits.P1ASEL               // bit 0
#define P1BSEL                  APFCONbits.P1BSEL               // bit 1
#define T1GSEL                  APFCONbits.T1GSEL               // bit 4

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define DC1B0                   CCP1CONbits.DC1B0               // bit 4
#define DC1B1                   CCP1CONbits.DC1B1               // bit 5
#define P1M                     CCP1CONbits.P1M                 // bit 7

#define C1CH                    CMCON0bits.C1CH                 // bit 0, shadows bit in CMCON0bits
#define C1CH0                   CMCON0bits.C1CH0                // bit 0, shadows bit in CMCON0bits
#define CMCH                    CMCON0bits.CMCH                 // bit 0, shadows bit in CMCON0bits
#define C1R                     CMCON0bits.C1R                  // bit 2, shadows bit in CMCON0bits
#define CMR                     CMCON0bits.CMR                  // bit 2, shadows bit in CMCON0bits
#define C1POL                   CMCON0bits.C1POL                // bit 4, shadows bit in CMCON0bits
#define CMPOL                   CMCON0bits.CMPOL                // bit 4, shadows bit in CMCON0bits
#define C1OE                    CMCON0bits.C1OE                 // bit 5, shadows bit in CMCON0bits
#define CMOE                    CMCON0bits.CMOE                 // bit 5, shadows bit in CMCON0bits
#define C1OUT                   CMCON0bits.C1OUT                // bit 6, shadows bit in CMCON0bits
#define COUT                    CMCON0bits.COUT                 // bit 6, shadows bit in CMCON0bits
#define C1ON                    CMCON0bits.C1ON                 // bit 7, shadows bit in CMCON0bits
#define CMON                    CMCON0bits.CMON                 // bit 7, shadows bit in CMCON0bits

#define C1SYNC                  CMCON1bits.C1SYNC               // bit 0, shadows bit in CMCON1bits
#define CMSYNC                  CMCON1bits.CMSYNC               // bit 0, shadows bit in CMCON1bits
#define T1GSS                   CMCON1bits.T1GSS                // bit 1
#define C1HYS                   CMCON1bits.C1HYS                // bit 3, shadows bit in CMCON1bits
#define CMHYS                   CMCON1bits.CMHYS                // bit 3, shadows bit in CMCON1bits
#define T1ACS                   CMCON1bits.T1ACS                // bit 4

#define PSSBD0                  ECCPASbits.PSSBD0               // bit 0
#define PSSBD1                  ECCPASbits.PSSBD1               // bit 1
#define PSSAC0                  ECCPASbits.PSSAC0               // bit 2
#define PSSAC1                  ECCPASbits.PSSAC1               // bit 3
#define ECCPAS0                 ECCPASbits.ECCPAS0              // bit 4
#define ECCPAS1                 ECCPASbits.ECCPAS1              // bit 5
#define ECCPAS2                 ECCPASbits.ECCPAS2              // bit 6
#define ECCPASE                 ECCPASbits.ECCPASE              // bit 7

#define GP0                     GPIObits.GP0                    // bit 0, shadows bit in GPIObits
#define GPIO0                   GPIObits.GPIO0                  // bit 0, shadows bit in GPIObits
#define RA0                     GPIObits.RA0                    // bit 0, shadows bit in GPIObits
#define GP1                     GPIObits.GP1                    // bit 1, shadows bit in GPIObits
#define GPIO1                   GPIObits.GPIO1                  // bit 1, shadows bit in GPIObits
#define RA1                     GPIObits.RA1                    // bit 1, shadows bit in GPIObits
#define GP2                     GPIObits.GP2                    // bit 2, shadows bit in GPIObits
#define GPIO2                   GPIObits.GPIO2                  // bit 2, shadows bit in GPIObits
#define RA2                     GPIObits.RA2                    // bit 2, shadows bit in GPIObits
#define GP3                     GPIObits.GP3                    // bit 3, shadows bit in GPIObits
#define GPIO3                   GPIObits.GPIO3                  // bit 3, shadows bit in GPIObits
#define RA3                     GPIObits.RA3                    // bit 3, shadows bit in GPIObits
#define GP4                     GPIObits.GP4                    // bit 4, shadows bit in GPIObits
#define GPIO4                   GPIObits.GPIO4                  // bit 4, shadows bit in GPIObits
#define RA4                     GPIObits.RA4                    // bit 4, shadows bit in GPIObits
#define GP5                     GPIObits.GP5                    // bit 5, shadows bit in GPIObits
#define GPIO5                   GPIObits.GPIO5                  // bit 5, shadows bit in GPIObits
#define RA5                     GPIObits.RA5                    // bit 5, shadows bit in GPIObits

